print('Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!).')

a = int(input())
b = str(a + 1)
c = str(a - 1)
a = str(a)
print('The next number for the number ' + a + ' is ' + b + '.')
x = print('The previous number for the number ' + a + ' is ' + c + '.')
